% clc
% clear all
% close all

% 准备好训练集
A1 = [1139.63 	1149.07 	1163.28 	1173.30 	1187.99 	1210.74 	1228.05 	1398.90 	1435.33 	1476.05];
A2 = [629.38 	650.91 	705.66 	716.72 	728.71 	755.77 	720.62 	784.60 	851.17 	899.50];
A3 = [417.87 	430.68 	439.69 	446.85 	455.05 	467.16 	475.99 	536.86 	550.65 	563.23];
B1 = [4503.00 	5551.30 	6854.58 	8138.90 	9108.89 	10056.59 	10801.16 	12170.23 	13889.39 	15342.77];
B2 = [35215.00 	41253.00 	49438.00 	57624.00 	63977.00 	70019.00 	74273.00 	76960.00 	86911.00 	94782.00];
B3 = [34195.00 	38603.00 	42363.00 	48302.00 	56581.00 	63201.00 	69123.00 	74408.00 	79292.00 	88011.00];
B4 = [5.94 	6.00 	6.80 	6.55 	6.15 	6.15 	5.50 	4.90 	4.90 	4.90];
B5 = [18659.40 	20835.34 	23932.08 	27193.65 	29968.00 	32665.00 	33476.00 	35902.00 	38917.50 	42127.85];
C1 = [945.14 	1278.34 	1588.22 	1889.23 	2111.25 	2215.53 	2435.25 	2638.89 	2492.65 	2273.16];
C2 = [2708.76 	2559.28 	2676.04 	2844.09 	2950.13 	2951.30 	2997.43 	3928.77 	3925.91 	3682.52];
C3 = [6810.00 	6943.00 	7288.00 	7206.00 	8020.00 	7655.00 	7609.00 	7983.00 	8940.00 	16695.00];
RO = [4925.00 	5937.00 	6716.71 	7288.24 	7197.00 	7032.00 	6875.00 	7504.00 	8733.00 	9866.60];
% 
test = [1500.07; 938.14; 576.95; 17012.65; 103386.00; 97519.00; 4.85; 45878.00; 2611.86; 3531.40; 18015.00];  

p = [A1; A2; A3; B1; B2; B3; B4; B5; C1; C2; C3]; %输入数据矩阵
p = [p,test];
t = RO; %输出数据矩阵
t = [4925.00, 5937.00, 6716.71, 7288.24, 7197.00, 7032.00, 6875.00, 7504.00, 8733.00, 9866.60, 10943.24];
% 归一化处理
[pn, inputStr] = mapminmax(p);
[tn, outputStr] = mapminmax(t); 
%  
% net = newff(pn, tn, 13, {'tansig', 'purelin'},'traingd'); %建立BP神经网络
%  
% net.trainParam.show = 100; %每10轮回显示一次结果
% net.trainParam.epochs = 10000; %最大训练次数
% net.trainParam.lr = 0.05; %网络的学习速率
% net.trainParam.goal = 1e-5;%训练网络所要达到的目标误差
% net.divideFcn = '';% 所有样本作为训练
% 
% net = train(net, pn, tn);%开始训练网络

% 绘制原始数据散点图
% m = 2009:2019;
% n = [4925.00, 5937.00, 6716.71, 7288.24, 7197.00, 7032.00, 6875.00, 7504.00, 8733.00, 9866.60, 10943.24];
% plot(m, n, '*');
% hold on;
% 
% 绘制拟真结果
% test = [1500.07; 938.14; 576.95; 17012.65; 103386.00; 97519.00; 4.85; 45878.00; 2611.86; 3531.40; 18015.00];  
j = p;
% jn = mapminmax('apply',j, inputStr);
% kn = sim(net, jn);
% k = mapminmax('reverse', kn, outputStr); 
% plot(m,k);
% hold on;
% 
% accuracy = 1- abs(k(end)- n(end))/n(end);

y = 2009:2019;
Y = 2009:2022;

t1 = polyfit(y,j(1,:),3);
a1 = polyval(t1,Y);
a1 = a1(12:end);

t2 = polyfit(y,j(2,:),3);
a2 = polyval(t2,Y);
a2 = a2(12:end);

t3 = polyfit(y,j(3,:),3);
a3 = polyval(t3,Y);
a3 = a3(12:end);

t4 = polyfit(y,j(4,:),3);
b1 = polyval(t4,Y);
b1 = b1(12:end);

t5 = polyfit(y,j(5,:),3);
b2 = polyval(t5,Y);
b2 = b2(12:end);

t6 = polyfit(y,j(6,:),3);
b3 = polyval(t6,Y);
b3 = b3(12:end);

t7 = polyfit(y,j(7,:),1);
b4 = polyval(t7,Y);
b4 = b4(12:end);

t8 = polyfit(y,j(8,:),3);
b5 = polyval(t8,Y);
b5 = b5(12:end);

t9 = polyfit(y,j(9,:),1);
c1 = polyval(t9,Y);
c1 = c1(12:end);

t10 = polyfit(y,j(10,:),1);
c2 = polyval(t10,Y);
c2 = c2(12:end);

t11 = polyfit(y,j(11,:),2);
c3 = polyval(t11,Y);
c3 = c3(12:end);

g = [a1;a2;a3;b1;b2;b3;b4;b5;c1;c2;c3];
g = [j,g];

gn = mapminmax('apply',g, inputStr);
sn = sim(net, gn);
s = mapminmax('reverse',sn, outputStr); 
plot(Y,s);
hold on;